from random import randint  # для случайного выбора чисел
import math
# import sys
from brain_games.scripts.games_logic import question

# пользователю показывается два случайных числа, например,
# 25 50. Пользователь должен вычислить и ввести наибольший
# общий делитель этих чисел.

# Добавьте в README.md аскинему с запуском и демонстрацией различных исходов игры

def rules_the_game():  # объясняем правила игры
    print('Find the greatest common divisor of given numbers.')

def gcd_game():  # поиск неизвестных
    # рандомизация неизвестных мини-игры
    num_1: int = randint(-100, 100)
    num_2: int = 0  # задаём стартовое значение для цикла
    # проверка, чтобы оба числа не были нулями одновременно
    if num_1 == 0:
        while num_2 == 0:
            num_2: int = randint(-100, 100)
    else:
        num_2: int = randint(-100, 100)
        print(num_1, num_2)
    # выясняем правильный ответ, используя функцию для поиска НОД,
    # делаем результат строкой, тк ввод игрока будет в виде строки,
    # а его ввод будет сравниваться с правильным ответом
    correct_answer: str = str(math.gcd(num_1, num_2))
    # делаем результат строкой для стандартизации аргументов в функции логики вопросов, чтобы 2 числа были 1 аргументом
    result: str = f'{num_1} {num_2}'
    return result, correct_answer


def main():  # точка входа для мини-игры brain-gcd
    # запускаем универсальную для всех мини-игр функцию
    # даём ей на вход неизвестное и правильный ответ для этой мини-игры
    question(gcd_game, rules_the_game)

if __name__ == '__main__':
    main()
