from random import randint

# Калькулятор; делаем только +, - и *
# Операции, как и числа, выбираются случайным образом (другой блок random)
# может пригодиться библиотека match

# Общая логика для всех игр:
# задать вопрос, получить ответ,
# сравнить ответ; везде 3 вопроса

# Задачи:
# написать код для этой игры в вакууме
# подумать, как объединить логику игр в один отдельный файл
# сделать файл точку входа main.py в scripts
# сделать коротку команду brain_calc
# аскинема в README.md
# создать поддиректорию games для самих игр
# общий код игр в отдельный модуль - движок,
# который и будет использовать каждую игру внутри себя